let a: number = 2;
let b: number = 3;

console.log(a * b);

const sum = (n: number, m: number) => {
  return n * m;
};

//-----------ジェネリック（その場で型をきめる）---------------------------------------

const addMrak = <T>(message: T) => {
  return "●" + message;
};

console.log(addMrak<string>("Hello World"));
//console.log(addMrak<number>("Hello World"));　型が一致していないときはエラーが発生する
///----------------------------------------------------------------------------------

//----------ユニオンタイプ（複数の型を指定できる）※多様すると型をしていできる意味がなくなるので多用はしてはいけない

let telNum: number | string;

telNum = 1244567; //number
telNum = "1234-5678"; //string

//----------------------------------------------------------------------------------

//----------型推論-----------------------------------------------------------------
let myname: any = "1234";

myname = 10;

//-------------------------------------------------------------------------------

//---------入れられる値を決めることもできる--------------------------------------------
let color: "赤" | "黄" | "青";
color = "赤";
//color = '黒'; エラー発生
//------------------------------------------------------------------------------------
